####################################################################################################
# admin_module
####################################################################################################

from basic_module import *

####################################################################################################

password = '/admin'

cnsl = { # console
    # manage_goods: 상품 관리
    1: str_c('판매 중인 상품 출력', 'B'),
    2: str_c('상품 재고 보충', 'B'),
    3: str_c('상품 이름 수정', 'B'),
    4: str_c('상품 가격 수정', 'B'),

    # manage_cash: 현금 관리
    5: str_c('보유 중인 현금 출력', 'Y'),
    6: str_c('현금 재고 보충', 'Y'),

    # break
    7: str_c('소비자 모드 실행', 'R'),
}

####################################################################################################
# start_loop
####################################################################################################

# 로그인
def login():
    print_l()

    i = input('아무 키나 입력하여 자동판매기 작동을 시작하세요.: ')
    print_l()

    if i == password:
        return True

####################################################################################################
# admin_loop (관리자 모드)
####################################################################################################

# 콘솔 출력
def print_cnsl():
    print('콘솔 메뉴 목록')
    print_l()

    for k, v in cnsl.items(): # key, value
        print(str(k)+'번\t'+v)
    print_l()

# 콘솔 입력
def input_cnsl():
    i = input_rng('실행할 메뉴의 번호를 입력하세요.', 1, max(cnsl))
    print_l()
    return i

####################################################################################################
# manage_goods: 상품 관리
####################################################################################################

# 상품 재고 보충
def edit_stock(d):
    k = input_rng('보충할 상품의 번호를 입력하세요.', 1, max(d))        # key
    s = input_rng('보충할 상품의 개수를 입력하세요.', 0, 10 - d[k][2])  # stock
    d[k][2] += s
    print_c('상품의 재고 보충이 완료되었습니다.', 'G')
    print_l()

# 상품 이름 수정
def edit_name(d):
    k = input_rng('이름을 수정할 상품의 번호를 입력하세요.', 1, max(d)) # key
    n = input('수정할 이름을 입력하세요.: ')                            # name
    d[k][0] = n
    print_c('상품의 이름 수정이 완료되었습니다.', 'G')
    print_l()

# 상품 가격 수정
def edit_price(d):
    k = input_rng('가격을 수정할 상품의 번호를 입력하세요.', 1, max(d)) # key
    p = input_unit('수정할 가격을 입력하세요.')                         # price
    d[k][1] = p
    print_c('상품의 가격 수정이 완료되었습니다.', 'G')
    print_l()

####################################################################################################
# manage_cash: 현금 관리
####################################################################################################

# 보유 중인 현금 출력
def print_cash(c):
    t = 0 # total
    for i in (100, 500, 1000): # iterator
        print(str(i)+'원:\t'+str(c[i][0])+'/100개')
        t += i * c[i][0]

    print('총액:\t'+str(t)+'원')
    print_l()

# 현금 재고 보충
def edit_cash(c):
    for i in (100, 500, 1000): # iterator
        c[i][0] += input_rng('투입할 '+str(i)+'원의 개수', 0, 100 - c[i][0])

    print_l()